/*
ЗАДАЧА 3
1.  Создайте класс исключение, который будет выбрасываться при делении на 0.
    Исключение должно отображать понятное для пользователя сообщение об ошибке.
2.  Создайте класс исключение, которое будет возникать при обращении к пустому элементу в массиве ссылочного типа.
    Исключение должно отображать понятное для пользователя сообщение об ошибке.
3.  Создайте класс исключение, которое будет возникать при попытке открыть несуществующий файл.
    Исключение должно отображать понятное для пользователя сообщение об ошибке.
*/


package Seminar3.Task3;

public class Main {
    public static void main(String[] args) {
        System.out.println("ЗАДАЧА 3.");
    }
}
